[ {
  "description" : "Keep the chest tall and focus on bringing in oxygen to help for quicker recovery. Shake out the limbs and get prepared for the next round.",
  "title" : "Rest"
}, {
  "description" : "Sit with the back off of the ground at a 45 degree angle with the legs extended to 2 inches. Bring both knees into the butt while keeping same hand position. Keep the heels at 2 inches the entire movement. Hold for 1 count. Push out through heels to starting position in controlled manner. ",
  "title" : "Hover Pushouts"
}, {
  "description" : "Lie on the back with legs extended. Keep the same hand position entire movement. Keep leg rigid the entire movement. Cross one foot over the other then repeat with opposite leg positions.",
  "title" : "Scissor Kick"
}, {
  "description" : "Lie on the back with the legs extended. Keep the same hand position for the entire movement. Keep the legs rigid the entire movement. Alternate the feet between 18 inches and 6 inches.",
  "title" : "Flutter Kick"
}, {
  "description" : "Lie on the back with the legs extended. Keep the same hand position for the entire movement. Keep the legs rigid the entire movement. Position the feet together. Make large circles in the same direction with your feet.",
  "title" : "Leg Circle (Clockwise)"
}, {
  "description" : "Lie on the back with the legs extended. Keep the same hand position for the entire movement. Keep the legs rigid the entire movement. Position the feet together. Make large circles in the same direction with your feet.",
  "title" : "Leg Circle (Counter-Clockwise)"
}, {
  "description" : "Lie on the back with the Link under the body. The legs are fully bent and the knees are at the chest. The shoulders remain on ground entire time. Simultaneously straighten the legs vertical and lift the lower back off the ground. Hold for 1 count. Return to starting position in controlled manner.",
  "title" : "Reverse Crunch"
}, {
  "description" : "Lie on the back with the Link under the body. The legs are fully bent and the knees are at the chest. The lower back starts off the floor and the shoulders remain on ground entire time. Straighten the legs horizontal. Hold for 1 count. Return to the starting position in controlled manner. ",
  "title" : "Dragonfly Crunch"
}, {
  "description" : "Lie on the back with band under the body. The legs are fully bent and the knees are at the chest. Shoulders remain on ground entire time. Simultaneously straighten the legs vertical and lift the lower back off the ground. Hold for 1 count. Return to starting position in controlled manner. Straighten the legs horizontal. Hold for 1 count. Return to starting position in controlled manner.",
  "title" : "Hip Extension - Bridge"
}, {
  "description" : "Squeeze the glutes and core. Position the band so it is applying downward force on the hip region. Push through the down heel and scapula. The feet stay in dorsiflexion. Raise the hips while keeping the glutes activated. Lead with the active leg heel. Hold for 3 count. Return the hips to starting position in a controlled manner.",
  "title" : "Hip Extension - Knee Up"
}, {
  "description" : "Squeeze the glutes and core. Position the band so it is applying downward force on the hip region. Push through the heels and scapula. The feet stay in dorsiflexion. Raise the hips while keeping the glutes activated until the shoulder, hips and knees are in line. Hinge one leg at the knee until the ankle aligns with body line. Hold for 3 count. Reset the foot to the floor. Return the hips to starting position in a controlled manner.",
  "title" : "Hip Extension - Leg Raise"
}, {
  "description" : "Stand tall with the arms resting at side. Hinge the arms parallel at the elbow in the frontal plane. Bring hands up to shoulders. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "T-Curl"
}, {
  "description" : "Stand tall with the arms resting at side. Hinge the arms parallel at the elbow midway between sagittal and frontal. Bring the hands up to shoulders. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Y-Curl"
}, {
  "description" : "Stand tall with the arms resting at side. Hinge the arms parallel at the elbow in the sagittal plane. Bring the hands up to shoulders. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "I-Curl"
}, {
  "description" : "Stand in quarter squat position, hinging at hips. The chest nears parallel to floor in relaxed state. The arms rest at the sides. The arms hinge at the elbows in sagittal plane. Keeping the elbows in the same position entire time, kick the hands back until the arm is fully extended. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Bent-Over Kick-Back"
}, {
  "description" : "Stand in quarter squat position. Hinging at hips, the chest nears parallel to floor in relaxed state. The arms rest with arms at the sides. The arms hinge at the elbows midway between frontal and sagittal plane plane. Keeping elbows in the same position entire time, kick the hands back until the arm is fully extended. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Bent-Over Kick-Out"
}, {
  "description" : "Stand tall with the arms resting at side. Raise the arms parallel to ground to make a \"T\" in the frontal plane. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "T-Raise"
}, {
  "description" : "Stand tall with the arms resting at side. Raise the arms parallel to ground to make a \"Y\" midway between the sagittal and frontal plane. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Y-Raise"
}, {
  "description" : "Stand tall with the arms resting at side. Raise the arms parallel to ground to make an \"I\" in the sagittal plane. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "I-Raise"
}, {
  "description" : "Stand tall with arms in 90 degree position. The hand is positioned behind the head and the elbow is positioned next to head. The band is positioned behind the body. Hinge at elbow and fully extend arms until forming straight line with the body. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Standing Kick-Up (Left Arm)"
}, {
  "description" : "Stand tall with arms in 90 degree position. The hand is positioned behind the head and the elbow is positioned next to head. The band is positioned behind the body. Hinge at elbow and fully extend arms until forming straight line with the body. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Standing Kick-Up (Right Arm)"
}, {
  "description" : "In all-4-up position on the hands and feet. Form a straight line from the head to feet. Bring one knee to the chest while keeping all points of leg off the ground and keeping a straight line with the body. Keep the head and neck relaxed. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Anchored Mountain Climbers"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to feet. Bring one knee to the same-side lat while keeping all points of leg off the ground and keeping a straight line with the body. Keep the head and neck relaxed. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Anchored Spiderman"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to feet. Hop both knees to chest and bring feet under the butt. Keep the head and neck relaxed. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Anchored Hop-In"
}, {
  "description" : "Lie on the back with legs extended. Bring both knees in so the legs are at a 90 degree angle. Hold for 1 count. Push out through heels to starting position in controlled manner. ",
  "title" : "Anchored Pull-In"
}, {
  "description" : "Lie on the back with the legs extended. Keep the shoulder blades off of the floor. Bring one knees in so leg is at 90 degree angle. Hold for 1 count. Push out through heels to starting position in a controlled manner while simultaneously repeating the motion with the other leg.",
  "title" : "Anchored Bicycle"
}, {
  "description" : "In all-4-up position on forearms and feet. Form a straight line from head to feet. Hands are at shoulder width. Do a push-up. At the top of the all-4-up position, tighten the core and bring one knee to the chest while keeping the body rigid. The active leg foot should stay off the ground. Return the active foot to starting position and repeat the movement with the other leg.",
  "title" : "Anchored Mountain Climber Push-Up"
}, {
  "description" : "Sit with the feet out in front with the arms extended in front parallel to the legs. Keep the chest up tall with the core tight. The hands are at hip width. Pull in until hands reach the obliques. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Seated Low Row"
}, {
  "description" : "Sit with the feet out in front with arms extended out in front parallel to the legs. Keep the chest up tall with the core tight. Hands are at hip width. Pull in until hands reach the upper lats. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Seated High Row"
}, {
  "description" : "Sit with the feet out in front with the arms extended out in front parallel to the legs. Keep the chest up tall with the core tight. The hands are together in the middle of the body. Pull in until hands reach the sternum. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Seated Pinch Row"
}, {
  "description" : "Stand in quarter squat position with chest close to parallel with the floor. Hinge at the hips. The hands are together in the middle of the body. Pull the hands to the sternum. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Standing Pinch Row"
}, {
  "description" : "Stand with the trunk bent near to parallel to the floor with arms resting at the sides. Hinge at the hips. Pull the hands up to eyes. The elbows will follow the hands up. Hold for 1 count. Return to resting position in controlled manner. ",
  "title" : "Delt Row"
}, {
  "description" : "Hinge at the hips to get into starting position. The back and chest are parallel to the ground with head up and legs straight/relaxed. Push the glutes forward and slowly straighten hips. Lead the movement upwards with the shoulders. Finish the ascent standing tall. Hold for 1 count. Bring the legs to a slight bend. Keep a slight arch in the back. Hinge at the hips and slowly descend until chest is parallel to the ground.",
  "title" : "Straight Leg Dead Lift"
}, {
  "description" : "Lie comfortably on side with the band wrapped around outside of knees and over the top of the thighs. Squeeze the glutes. Slowly spread the knees apart while keeping feet together in stacked position. Hold for 3 count. Bring the legs back to starting position in controlled manner.",
  "title" : "Clamshell with Lift (Right Leg)"
}, {
  "description" : "Lie comfortably on side with the band wrapped around outside of knees and over the top of the thighs. Squeeze the glutes. Slowly spread the knees apart while keeping feet together in stacked position. Hold for 3 count. Bring the legs back to starting position in controlled manner.",
  "title" : "Clamshell with Lift (Left Leg)"
}, {
  "description" : "Sit down with feet tucked in as close to the groin as possible. Wrap the band under the knees and over the top of the thighs. Rest the knees at a comfortable position. While maintaining the same foot position, push the knees out until uncomfortable. Keep hands at side. Hold for 3 count. Switch direction of knees and bring them together in controlled manner. Hold for 3 count.",
  "title" : "Butterfly"
}, {
  "description" : "Start by drawing in the stomach and bracing the upper body while keeping the neck relaxed. Squeeze the glutes. Extend the working leg. Push through the heel and hinge at both the hip and the knee. The knee will not lock out until the moment your leg reaches hip level at max extension. Hold for 1 count. Return the leg to starting position in a controlled manner.",
  "title" : "Glute Kick-Back (Right Leg)"
}, {
  "description" : "Start by drawing in the stomach and bracing the upper body while keeping the neck relaxed. Squeeze the glutes. Extend the working leg. Push through the heel and hinge at both the hip and the knee. The knee will not lock out until the moment your leg reaches hip level at max extension. Hold for 1 count. Return the leg to starting position in a controlled manner.",
  "title" : "Glute Kick-Back (Left Leg)"
}, {
  "description" : "Start by drawing in the stomach and bracing the upper body while keeping the neck relaxed. Squeeze the glutes. Push through the heel and hinge at the hip and the knee. As the foot is pushed up into the air, the knee will extend the foot further up. Finish the movement with the foot parallel to the ground. Hold for 1 count. Return the leg to starting position in a controlled manner.",
  "title" : "Glute Kick-Up (Right Leg)"
}, {
  "description" : "Start by drawing in the stomach and bracing the upper body while keeping the neck relaxed. Squeeze the glutes. Push through the heel and hinge at the hip and the knee. As the foot is pushed up into the air, the knee will extend the foot further up. Finish the movement with the foot parallel to the ground. Hold for 1 count. Return the leg to starting position in a controlled manner.",
  "title" : "Glute Kick-Up (Left Leg)"
}, {
  "description" : "Engage the core. Initiate the movement from the hips. Position the band up the front side of the body. Drop the hips as if you are going to sit in a chair, slowly lower the body until your thighs are parallel to the ground. Hold for 1 count. Push through the heels. Return to starting position in a controlled manner. ",
  "title" : "Front Squat"
}, {
  "description" : "Engage the core. Initiate movement from the hips. Position the band up the back or front of the body. Drop the hips as if you are going to sit in a chair and lower the body until your thighs are parallel to the ground. The band stays at the shoulders during the squat. Push through the heels and transfer weight to the toes as your body rise. Jump in the air with the body full extended. As you land, transition directly back into a squat.",
  "title" : "Squat Jump"
}, {
  "description" : "Squat down into quarter-squat position. Activate the glutes. Create appropriate slack between feet as to not put too much stress on the band. Take a 10 inch step forward. Follow with a 10 inch following step forward with other foot. Reverse direction after the set.",
  "title" : "Monster Walk"
}, {
  "description" : "Squat down into quarter-squat position. Activate the glutes. Create appropriate slack between feet as to not put too much stress on the band. Take a 10 inch step to the side with near foot. You will now have a wider stance. Follow with a 10 inch following step in same direction with other foot. Stance will return to normal. Reverse direction after the set. ",
  "title" : "X-Walk (Left)"
}, {
  "description" : "Squat down into quarter-squat position. Activate the glutes. Create appropriate slack between feet as to not put too much stress on the band. Take a 10 inch step to the side with near foot. You will now have a wider stance. Follow with a 10 inch following step in same direction with other foot. Stance will return to normal. Reverse direction after the set. ",
  "title" : "X-Walk (Right)"
}, {
  "description" : "Squeeze the glutes and keep the core tight. Lift the active leg in a backwards kicking fashion while keeping the leg straight. Lead with the heel. The toes remain facing forward entire time. Return the active leg to starting position in a controlled manner.",
  "title" : "Standing Hip Extension (Right Leg)"
}, {
  "description" : "Start by activating the glutes. Ensure that the chest is high and the core is tight. Slowly bring the active leg forward and up without bending the leg. Ensure the trunk does not twist. Raise the leg as far as comfortable. Hold for 3 count. Return the leg to starting position in a controlled manner.",
  "title" : "Leg Raise (Right Leg)"
}, {
  "description" : "Squeeze the glutes and keep the core tight. Lift the active leg in a backwards kicking fashion while keeping the leg straight. Lead with the heel. The toes remain facing forward entire time. Return the active leg to starting position in a controlled manner.",
  "title" : "Standing Hip Extension (Left Leg)"
}, {
  "description" : "Start by activating the glutes. Ensure that the chest is high and the core is tight. Slowly bring the active leg forward and up without bending the leg. Ensure the trunk does not twist. Raise the leg as far as comfortable. Hold for 3 count. Return the leg to starting position in a controlled manner.",
  "title" : "Leg Raise (Left Leg)"
}, {
  "description" : "Stand with the knees slightly bent. The hands start at the chest and the elbows are tight to the sides. The palms start facing in. Punch forward with arm parallel to the floor. Twist the wrist into downward facing palm as you punch. Finish at full extension in sagittal plane. Hold for 1 count. Return to resting position in a controlled manner. ",
  "title" : "Punch"
}, {
  "description" : "Stand with the trunk bent towards the floor with the hands starting at the opposite knee. The arms are slightly bent and rigid. Hinge at the hips. The band is crossed in the middle. Move the arms out until parallel to ground and perpendicular to center. Hold for 1 count. Return to the starting position in controlled manner.",
  "title" : "2 Arm Pulley"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to heel. Bring the hand up to eye level. The elbow will follow the hand. Hold for 1 count. Keep the core tight and the glutes squeezed. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Plank Delt Row"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to feet. Lift and bring the directional side foot and hand about 18 inches to the same side, place the foot on the floor. Lift and bring the backside hand and foot about 18 inches in the same direction, place the foot on the floor.",
  "title" : "Plank Walk (Right)"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to feet. Lift and bring the directional side foot and hand about 18 inches to the same side, place the foot on the floor. Lift and bring the backside hand and foot about 18 inches in the same direction, place the foot on the floor.",
  "title" : "Plank Walk (Left)"
}, {
  "description" : "Attach the bands through the D-rings with the same side hand and foot connected by the band. Rest the band behind the back. Lift the feet and hands to six inches and hold. Retract shoulders back. Arms start at 90 degrees. Push hands forward until fully extended out in front. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Superman Press"
}, {
  "description" : "Stand tall with the arms resting in front. Bring the elbows and hands up to eye height while keeping trunk straight and chest and chin high. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Straight High Pull"
}, {
  "description" : "Stand tall with the arms resting in front with the band crossed in \"X\" fashion. Bring the elbows and hands up to eye height while keeping trunk straight and chest and chin high. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Crossing High Pull"
}, {
  "description" : "Stand on one leg with the other leg lifted in the air. The up leg knee is at hip height. Push off of the down foot forward and have the opposite foot come down in a forward lunge position (making sure to land on the ball of the foot). Quickly push off the now down foot and return to the starting position. Hold the starting position until balance is confirmed.",
  "title" : "Front Balance Drill (Right Leg)"
}, {
  "description" : "Stand on one leg with the other leg lifted in the air. The up leg knee is at hip height. Push off of the down foot forward and have the opposite foot come down in a forward lunge position (making sure to land on the ball of the foot). Quickly push off the now down foot and return to the starting position. Hold the starting position until balance is confirmed.",
  "title" : "Front Balance Drill (Left Leg)"
}, {
  "description" : "Stand on one leg with the other leg lifted in the air. The up leg knee is at hip height. Push off of the down foot sideways and have the opposite foot come down in a side lunge position (making sure to land on the ball of the foot). Quickly push off the now down foot and return to the starting position. Hold the starting position until balance is confirmed.",
  "title" : "Side Balance Drill"
}, {
  "description" : "Sit with the back off of the ground at a 45 degree angle. Hold the hands together in front of the chest. Rotate the hands as far as you can while keeping arms straight. The eyes follow the hands the entire movement. Return to the starting position in controlled manner.",
  "title" : "Rocky Solo"
}, {
  "description" : "Lying on the back with the legs extended out in front. Grab the middle of the band with both hands. Keep both legs rigid for the entire movement. Bring the hands straight up towards the head as far as possible, ensuring that the down leg remains in the starting position and the active leg does stays rigid.",
  "title" : "Lateral Hamstring Stretch (Right Leg)"
}, {
  "description" : "Lying on the back with the legs extended out in front. Grab the middle of the band with both hands. Keep both legs rigid for the entire movement. Bring the hands straight up towards the active leg side shoulder as far as possible, ensuring that the down leg remains in the starting position and the active leg stays rigid.",
  "title" : "Middle Hamstring Stretch (Right Leg)"
}, {
  "description" : "Lying on the back with the legs extended out in front. Grab the middle of the band with both hands. Keep both legs rigid for the entire movement. Bring the hands straight up towards the active leg side shoulder as far as possible, ensuring that the down leg remains in the starting position and the active leg stays rigid.",
  "title" : "Medial Hamstring Stretch (Right Leg)"
}, {
  "description" : "Standing tall, grab the band with the active side hand and bend your active leg knee so the foot comes up to the glutes. Bring the active hand up behind the head. Pull the hands up to full extension above the head.",
  "title" : "Lying Quad Stretch (Right Leg)"
}, {
  "description" : "Lying on the back with the legs extended out in front. Grab the middle of the band with both hands. Keep both legs rigid for the entire movement. Bring the hands straight up towards the head as far as possible, ensuring that the down leg remains in the starting position and the active leg does stays rigid.",
  "title" : "Lateral Hamstring Stretch (Left Leg)"
}, {
  "description" : "Lying on the back with the legs extended out in front. Grab the middle of the band with both hands. Keep both legs rigid for the entire movement. Bring the hands straight up towards the active leg side shoulder as far as possible, ensuring that the down leg remains in the starting position and the active leg stays rigid.",
  "title" : "Middle Hamstring Stretch (Left Leg)"
}, {
  "description" : "Lying on the back with the legs extended out in front. Grab the middle of the band with both hands. Keep both legs rigid for the entire movement. Bring the hands straight up towards the active leg side shoulder as far as possible, ensuring that the down leg remains in the starting position and the active leg stays rigid.",
  "title" : "Medial Hamstring Stretch (Left Leg)"
}, {
  "description" : "Standing tall, grab the band with the active side hand and bend your active leg knee so the foot comes up to the glutes. Bring the active hand up behind the head. Pull the hands up to full extension above the head.",
  "title" : "Lying Quad Stretch (Left Leg)"
}, {
  "description" : "Attach the bands through the D-rings with the same side hand and foot connected by the band. Rest the band in front of the body. Lift the opposite hand and foot to six inches and hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Alternating Superman"
}, {
  "description" : "Attach the bands through the D-rings with the same side hand and foot connected by the band. Rest the band in front of the body. Lift the same-side hand and foot to six inches and hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Same-Side Superman"
}, {
  "description" : "In all-4-up position on forearms/hands and feet. Form a straight line from head to feet. Bring the hand up to eye level. The elbow will follow the hand. Hold for 1 count. Keep the core tight and the glutes squeezed. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Plank Delt Row (Right Arm)"
}, {
  "description" : "In all-4-up position on forearms/hands and feet. Form a straight line from head to feet. Bring the hand up to eye level. The elbow will follow the hand. Hold for 1 count. Keep the core tight and the glutes squeezed. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Plank Delt Row (Left Arm)"
}, {
  "description" : "Lie on the floor with the legs extended and arms moving towards a \"T\" formation. Grab the the band with the opposite side hand. Bring the active leg perpendicular to the floor. Keep the both legs rigid. Pull the leg across the body and down towards the opposite side hand. Keep the shoulder blades pressed to the floor.",
  "title" : "Outer Hip Stretch (Right Leg)"
}, {
  "description" : "Lie on the floor with the legs extended and arms making a \"T\" formation. Grab the band with the opposite side hand.Bring the active leg perpendicular to the floor. Keep the both legs rigid. Pull the leg out and down towards the same-side hand. Keep the shoulder blades pressed to the floor.",
  "title" : "Groin Stretch (Right Leg)"
}, {
  "description" : "Lie on the floor with the legs extended and arms moving towards a \"T\" formation. Grab the the band with the opposite side hand. Bring the active leg perpendicular to the floor. Keep the both legs rigid. Pull the leg across the body and down towards the opposite side hand. Keep the shoulder blades pressed to the floor.",
  "title" : "Outer Hip Stretch (Left Leg)"
}, {
  "description" : "Lie on the floor with the legs extended and arms making a \"T\" formation. Grab the band with the opposite side hand.Bring the active leg perpendicular to the floor. Keep the both legs rigid. Pull the leg out and down towards the same-side hand. Keep the shoulder blades pressed to the floor.",
  "title" : "Groin Stretch (Left Leg)"
}, {
  "description" : "Lift and bring the RIGHT HAND forward about 18 inches, place the hand on the floor. Lift and bring the LEFT FOOT forward about 18 inches, place the foot on the floor. Lift and bring the LEFT HAND forward about 18 inches, place the hand on the floor. Lift and bring the RIGHT FOOT forward about 18 inches, place the foot on the floor.",
  "title" : "Bear Crawl"
}, {
  "description" : "Position the body up sideways on the forearm and the downside foot. Form a straight line from the head to feet. The top hand is extended to line up with the down arm. Reach the LinkTM hand under the body as if attempting to grab something behind the body. Follow the LinkTM hand with the eyes.",
  "title" : "Side Plank Reach Under (Right Side)"
}, {
  "description" : "Position the body up sideways on the forearm and the downside foot. Form a straight line from the head to feet. The top hand is extended to line up with the down arm. Reach the LinkTM hand under the body as if attempting to grab something behind the body. Follow the LinkTM hand with the eyes.",
  "title" : "Side Plank Reach Under (Left Side)"
}, {
  "description" : "Lift and bring the RIGHT FOOT backwards about 18 inches, place the foot on the floor. Lift and bring the LEFT HAND backwards about 18 inches, place the hand on the floor. Lift and bring the LEFT FOOT backwards about 18 inches, place the foot on the floor. Lift and bring the RIGHT HAND backwards about 18 inches, place the hand on the floor.",
  "title" : "Reverse Bear Crawl"
}, {
  "description" : "Lie on the back with arms above the head and legs extended. The LinkTM is in front of the body. Simultaneously bring the arms and legs to 90 degrees, meeting in the middle. Return to starting position in controlled manner.",
  "title" : "V-Up"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to feet. Lift and bring one foot up next to the same side hand. Hop the up foot back to original placement while simultaneously hopping the opposite up next to its same side hand.",
  "title" : "Groiner"
}, {
  "description" : "Stand with your feet shoulder-width apart and your arms at chest height. Drop the hips as if you are going to sit in a chair and lower the body until your thighs are parallel to the ground. At full depth, place the hands on the ground and shift the body weight forward. \"Hop\" the legs back into a plank position. Do a push-up. \"Hop\" the legs forward to return to a squat position, bringing the hands off of the ground. Push through the toes into full extended jump with the hands resting at shoulder height. Land in squat position for next rep.",
  "title" : "Burpee"
}, {
  "description" : "Standing in quarter squat position with hands at shoulder width at the shins. The feet are slightly wider than shoulder width apart and toes pointing out slightly. The band is in front of the body. Extend the hips and the knees while keeping the arms rigid downward. As the hands pass the knees, thrust the hips forward and slightly bend the knees to avoid locking them. Quickly extend the hips and knees and stand up on the toes. Keep the hands as close to your body as possible. When the lower body is fully extended, shrug the shoulders upward rapidly while maintaining rigid arm position. As the shoulders reach their highest elevation \"break\" your elbows. Continue to pull the hands as high and as long as possible. Flip the wrists so the palms are facing inwards and \"catch\" the weight that is applying force downwards. Simultaneously, flex the hips and knees into a squat position. Keep elbows at hand height. Finish the movement with a front squat.",
  "title" : "Clean"
}, {
  "description" : "Start with feet at shoulder width and hands at the hips and the band crossed in front. Jump into the air about 5 inches, bringing the feet out to hip width+2 position. While in the air, pull hands up to shoulder level (crossing high pull). Upon landing, slightly bend the knees into a quarter squat position and bring the feet back and hands back to original stance.",
  "title" : "X-Jack"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to feet. Keeping the feet together, jump them up and to the outside of the right hand. Keep the hands in place and engaging the core. Jump them back to the original plank position. Jump the feet up and to the outside of the left hand and back to plank again. Jump them back to the original plank position.",
  "title" : "Ski Jump"
}, {
  "description" : "Engage the core. Initiate movement from the hips. Position the band up the front side of the body. Drop the hips as if you are going to sit in a chair. As you lower the body, lift the arms up. Keep the arms rigid and hinge at the shoulders. The arms should be locked out in \"I\" formation at the bottom of the squat. Push through the heels and bring the body into standing tall position while hinging the arms back into starting position. ",
  "title" : "Squat Lift"
}, {
  "description" : "In all-4-up position on forearms and feet. Form a straight line from head to feet. The band runs down the front side of the body. The hands are at shoulder width. Steadily drop the body while remaining rigid until hovering above the ground. As you approach full arm extension on the way back up, push up onto one arm and twist to the side. Extend the up-arm in line with the down arm. Hold for 1 count.  Return to starting position in controlled manner.",
  "title" : "Push-Up with Rotation"
}, {
  "description" : "Activate the hips and glutes for stability. Drop the back knee straight down to the floor while keeping it in line with same-leg foot. Once at the bottom of the movement, drive through the heel of the front foot while pushing through the quads to straighten both legs.",
  "title" : "Split Squat (Right Leg Up)"
}, {
  "description" : "Activate the hips and glutes for stability. Drop the back knee straight down to the floor while keeping it in line with same-leg foot. Once at the bottom of the movement, drive through the heel of the front foot while pushing through the quads to straighten both legs.",
  "title" : "Split Squat (Left Leg Up)"
}, {
  "description" : "Squeeze the down-leg glute and step forward by pushing off down-leg (don't simply reach with active-leg). Drop the back knee straight down to the floor while keeping it in line with same-leg foot. Push through the heel of the active front leg and bring the front foot back into hip width stance.",
  "title" : "Forward Lunge (Right Leg)"
}, {
  "description" : "Squeeze the down-leg glute and step forward by pushing off down-leg (don't simply reach with active-leg). Drop the back knee straight down to the floor while keeping it in line with same-leg foot. Push through the heel of the active front leg and bring the front foot back into hip width stance.",
  "title" : "Forward Lunge (Left Leg)"
}, {
  "description" : "Engage the core. Initiate the movement from the hips. Attach the band to itself and both handles. Pull the band up to the middle of the chest. Drop the hips as if you are going to sit in a chair, slowly lower the body until your thighs are parallel to the ground. Hold for 1 count. Push through the heels. Return to starting position in a controlled manner.",
  "title" : "Sumo Squat"
}, {
  "description" : "Squeeze the down-leg glute and step to the side by pushing off the down-leg (don't just reach with stepping leg). Once the stance is at full width, sit the hips down towards the active leg until the active-leg thigh is parallel to the ground. Push off through the center of the active-foot explosively and return to starting position.",
  "title" : "Side Lunge (Right Leg)"
}, {
  "description" : "Squeeze the down-leg glute and step to the side by pushing off the down-leg (don't just reach with stepping leg). Once the stance is at full width, sit the hips down towards the active leg until the active-leg thigh is parallel to the ground. Push off through the center of the active-foot explosively and return to starting position.",
  "title" : "Side Lunge (Left Leg)"
}, {
  "description" : "Engage the core. Initiate the movement from the hips. Position the band up the backside of the body. The band presses over the shoulders with the hands at the collar bone. Drop the hips as if you are going to sit in a chair, slowly lower the body until your thighs are parallel to the ground. Hold for 1 count. Push through the heels. Return to starting position in a controlled manner. ",
  "title" : "Back Squat"
}, {
  "description" : "Start standing tall with the core tight. Initiate the movement from the hips. Position the band up the backside of the body. Hands stay at chest height. Drop into quarter squat position and spring up into a jump. While in the air, bring the heels up to the butt. As you land, transition directly back into a squat.",
  "title" : "Butt Kick Jump"
}, {
  "description" : "Start standing tall with the core tight. Initial movement from the hips. Position the band up the front side of the body. Hands stay at chest height. Drop into quarter squat position and spring up into a jump. While in the air, bring the knees up into the chest. As you land, transition directly back into a squat.",
  "title" : "Tuck Jump"
}, {
  "description" : "Stand with knees slightly bent and hands at chest height. Drop the hips as if you are going to sit in a chair and lower the body until your thighs are parallel to the ground. The band stays at the chest during the squat. Push through the balls of the feet and reverse the motion by extending through the hips. Simultaneously extend the elbows to straighten the arms during the upward movement. As full body extension is reached, jump up and out, following the hands with the body. Land is squat position and return hands to chest height.",
  "title" : "Jammer Jump"
}, {
  "description" : "Stand in quarter squat position. The hands are between the legs at floor level. Push through the toes and fully extend the body by pushing hips forward. Start to swing the arms forward while keeping the arms rigid. As the hands reach full extension, jump up and out to match the momentum of the arms. During landing, the hands should be on downward path to return to starting position and the body should transition to a squat.",
  "title" : "Swing Jump"
}, {
  "description" : "Stand in quarter squat position. The hands are between the legs at ground level. Push through the heels and fully extend the body pushing the hips forward. Swing the arms to full extension above the head. Return to starting position in controlled manner.",
  "title" : "Middle Swing"
}, {
  "description" : "Straighten the legs and lengthen the trunk. Pinch the shoulder blades together and activate the core. Bring the legs to a slight bend. Keep a slight arch in the back. Hinge at the hips and slowly descend until chest is parallel to the ground. Hold for 1 count. Push the glutes forward and slowly straighten hips. Lead movement upwards with the shoulders. Finish ascent standing tall.",
  "title" : "Good Morning"
}, {
  "description" : "Squeeze the down-leg glute and step backwards by pushing off the down-leg (don't simply reach with active-leg). Drop the back knee straight down to the floor while keeping it in line with same-leg foot. Push through the heel of the active back leg and bring the back foot back into hip width stance.",
  "title" : "Reverse Lunge (Right Leg)"
}, {
  "description" : "Squeeze the down-leg glute and step backwards by pushing off the down-leg (don't simply reach with active-leg). Drop the back knee straight down to the floor while keeping it in line with same-leg foot. Push through the heel of the active back leg and bring the back foot back into hip width stance.",
  "title" : "Reverse Lunge (Left Leg)"
}, {
  "description" : "Start movement by activating the glutes. Set active foot so the heel is slightly lifted and positioned in front of down leg foot. While keeping a tight core and resisting twisting in the trunk, bring the foot away from the body until uncomfortable. Make sure the leg remains rigid the entire time. Hold for 3 count. Return the leg to starting position in a controlled manner.",
  "title" : "Standing Hip Abduction (Right Leg)"
}, {
  "description" : "Start movement by activating the glutes. Set active foot so the heel is slightly lifted and positioned in front of down leg foot. While keeping a tight core and resisting twisting in the trunk, bring the foot away from the body until uncomfortable. Make sure the leg remains rigid the entire time. Hold for 3 count. Return the leg to starting position in a controlled manner.",
  "title" : "Standing Hip Abduction (Left Leg)"
}, {
  "description" : "Stand with the arms slightly bent with both hands together at one hip. The torso twists in same direction as the hands. The eyes follow the hands the entire movement. \"Throw\" hands forward, lining the arms up with the body. Return to resting position in controlled manner.",
  "title" : "Front Ball Throw"
}, {
  "description" : "Stand tall with the arms straight at sides. Rotate arms counterclockwise (out, up, out, down) and draw large imaginary circle with hands in front of body.",
  "title" : "Big Circle (Counter-Clockwise)"
}, {
  "description" : "Stand tall with the arms straight at sides. Rotate arms counterclockwise (out, up, out, down) and draw large imaginary circle with hands in front of body.",
  "title" : "Big Circle (Clockwise)"
}, {
  "description" : "Stand tall with the hands held in front. Rotate the torso as far as possible to the other side. Return to starting position in controlled manner.",
  "title" : "Standing Russian Twists"
}, {
  "description" : "Start in bent knee position with hands together at down foot. Eyes remain focus on hands. The arms are rigid the entire movement. Rotate the arms up and across. Finish standing tall with hands high above head on opposite side. Return to beginning position in controlled manner. ",
  "title" : "Lift and Twist (Right Side)"
}, {
  "description" : "Start in bent knee position with hands together at down foot. Eyes remain focus on hands. The arms are rigid the entire movement. Rotate the arms up and across. Finish standing tall with hands high above head on opposite side. Return to beginning position in controlled manner. ",
  "title" : "Lift and Twist (Left Side)"
}, {
  "description" : "Positioned up sideways on the forearm and downside foot. Form a straight line from the head to feet. The top hand is extended to line up with down arm. Hold the up position working to keep glutes squeezed and hips up.",
  "title" : "Side Plank Hold (Right Side)"
}, {
  "description" : "Position up sideways on the forearm and downside foot. Form a straight line from the head to feet. The top hand is extended to line up with down arm. Reach the band hand under the body as if attempting to grab something behind the body. Follow the band hand with the eyes. Hold underneath for 1 count. Return to starting position in controlled manner.",
  "title" : "Side Plank Hip Dip (Right Side)"
}, {
  "description" : "Positioned up sideways on the forearm and downside foot. Form a straight line from the head to feet. The top hand is extended to line up with down arm. Hold the up position working to keep glutes squeezed and hips up.",
  "title" : "Side Plank Hold (Left Side)"
}, {
  "description" : "Position up sideways on the forearm and downside foot. Form a straight line from the head to feet. The top hand is extended to line up with down arm. Reach the band hand under the body as if attempting to grab something behind the body. Follow the band hand with the eyes. Hold underneath for 1 count. Return to starting position in controlled manner.",
  "title" : "Side Plank Hip Dip (Left Side)"
}, {
  "description" : "Start by resting arms at the sides. Cross the feet. Holding the handle with active side hand, reach the active arm over the head. Allow the tension of the band to stretch the opposite side.",
  "title" : "Standing Side Stretch (Right Side)"
}, {
  "description" : "Start by resting arms at the sides. Cross the feet. Holding the handle with active side hand, reach the active arm over the head. Allow the tension of the band to stretch the opposite side.",
  "title" : "Standing Side Stretch (Left Side)"
}, {
  "description" : "In all-4-up position on forearms and feet. Form a straight line from the head to feet. Keep the core tight and the glutes squeezed. Reach the opposite arm and leg out. Hold for 3 count. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Opposite Plank Reach (Right Arm)"
}, {
  "description" : "In all-4-up position on forearms and feet. Form a straight line from the head to feet. Keep the core tight and the glutes squeezed. Reach the opposite arm and leg out. Hold for 3 count. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Opposite Plank Reach (Left Arm)"
}, {
  "description" : "In all-4-up position on the forearms and feet. Form a straight line from the head to feet. The band is attached to opposite hand and foot. Start with hand extended at 6 inches. Keep the core tight and the glutes squeezed. Reach the extended hand inward towards opposite foot. Hold for 3 count. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Plank Pull Through (Right Arm)"
}, {
  "description" : "In all-4-up position on the forearms and feet. Form a straight line from the head to feet. The band is attached to opposite hand and foot. Start with hand extended at 6 inches. Keep the core tight and the glutes squeezed. Reach the extended hand inward towards opposite foot. Hold for 3 count. Return to starting position in controlled manner and repeat with opposite side.",
  "title" : "Plank Pull Through (Left Arm)"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from the head to feet. Keeping your hips as level as possible, jump both feet out to hip width +2, similar to a jumping jack stance. Jump your feet back to the starting plank position.",
  "title" : "Plank Jack"
}, {
  "description" : "Engage the core. Initiate movement from the hips. Position the band up the front side of the body. Drop the hips as if you are going to sit in a chair and lower the body until your thighs are parallel to the ground. The band stays at the shoulders during the squat. Push through the heels. As you stand up punch across the body towards one side with the opposite arm. As the arm comes back in, dip back down into squatting position.",
  "title" : "Squat Side Punch"
}, {
  "description" : "Stand in staggered squat position with the band connecting both feet. The band should be fully extended but not providing noticeable tension at rest.\"Kick\" the back foot backwards 12 inches. Lead by pushing with the heel. The front leg will extend as the back leg is repositioned. Step backward with the front foot 12 inches, returning to starting position.",
  "title" : "Kick Slide (Left Foot Up)"
}, {
  "description" : "Stand in staggered squat position with the band connecting both feet. The band should be fully extended but not providing noticeable tension at rest. Step forward with the front foot 12 inches while dropping the back knee to hover above the ground. Step forward with the back foot 12 inches, returning to starting position.",
  "title" : "Stacked Shuffle (Left Foot Up)"
}, {
  "description" : "Stand in staggered squat position with the band connecting both feet. The band should be fully extended but not providing noticeable tension at rest.\"Kick\" the back foot backwards 12 inches. Lead by pushing with the heel. The front leg will extend as the back leg is repositioned. Step backward with the front foot 12 inches, returning to starting position.",
  "title" : "Kick Slide (Right Foot Up)"
}, {
  "description" : "Stand in staggered squat position with the band connecting both feet. The band should be fully extended but not providing noticeable tension at rest. Step forward with the front foot 12 inches while dropping the back knee to hover above the ground. Step forward with the back foot 12 inches, returning to starting position.",
  "title" : "Stacked Shuffle (Right Foot Up)"
}, {
  "description" : "Start by drawing in the stomach and bracing the upper body while keeping the neck relaxed. Squeeze the glutes. Keep the leg at a 90 degree angle for the entirety of the movement. Move the active leg out by hinging outward. As the leg swivels, push the outside of the knee up towards the sky. Return the leg to starting position in a controlled manner.",
  "title" : "Hip Abduction (Right Leg)"
}, {
  "description" : "Start by drawing in the stomach and bracing the upper body while keeping the neck relaxed. Squeeze the glutes. Keep the leg at a 90 degree angle for the entirety of the movement. Move the active leg out by hinging outward. As the leg swivels, push the outside of the knee up towards the sky. Return the leg to starting position in a controlled manner.",
  "title" : "Hip Abduction (Left Leg)"
}, {
  "description" : "Stand with hip width +1 stance. The arms are extended out in frontal plane making a \"T\" with a handle in each hand. Drop the hips as if you are going to sit in a chair and lower the body until the thighs are parallel to the ground. While dropping down, move the arms out in front while keeping the arms parallel to the floor. Stand in a low squat stance with your feet shoulder-width apart and arms held out in front of you with your palms facing in. Push through the heels and return to a standing tall position with arms in \"T\" position in a controlled manner.",
  "title" : "Iron Cross"
}, {
  "description" : "Lie with the active leg on the ground. Grab the band with the active side hand and bend your active leg knee. Bring the active hand up behind the head. Pull the hands up to full extension above the head. Reach with the off arm and try to get both shoulder blades to rest on the floor.",
  "title" : "Quad Stretch with Twist (Right Leg)"
}, {
  "description" : "Lie with the active leg on the ground. Grab the band with the active side hand and bend your active leg knee. Bring the active hand up behind the head. Pull the hands up to full extension above the head. Reach with the off arm and try to get both shoulder blades to rest on the floor.",
  "title" : "Quad Stretch with Twist (Left Leg)"
}, {
  "description" : "Start by resting arms at the sides. Hold the band behind the back. Keep arms straight the entire movement. Raise the arms into a \"T\" position so they are parallel to the floor. Keeping the traps squeezed, allow the band to pull the hands together.",
  "title" : "Pec Stretch (Double Arm)"
}, {
  "description" : "Start by resting arms at the sides. Keep the active arm straight the entire movement. Set the anchor point at shoulder height in front of the body. The palm on the active hand should remain facing down. Step backwards until arm is pulled away from the body. Dip the chest and slowly shift the hips backwards.",
  "title" : "Rear Deltoid Stretch (Right Arm)"
}, {
  "description" : "Start by resting arms at the sides. Keep the active arm straight the entire movement. Set the anchor point at shoulder height in front of the body. The palm on the active hand should remain facing down. Step backwards until arm is pulled away from the body. Dip the chest and slowly shift the hips backwards.",
  "title" : "Rear Deltoid Stretch (Left Arm)"
}, {
  "description" : "Start by resting arms at the sides. Hold the band in front of the body. Keep arms straight the entire movement. Raise the arms in an \"I\" position so they are parallel to the floor. Keeping the traps squeezed, pull the bands apart into a \"T\" position.",
  "title" : "Scapula Stretch"
}, {
  "description" : "Start by resting arms at the sides. Hold the band behind the back. Bend the active arm and bring the hand the neck with the palm facing in. Bend the down arm and bring the hand to the lower back with the palm facing out. Slowly decrease the distance of the hands while keeping a grip on the band.",
  "title" : "Tricep Stretch (Right Arm)"
}, {
  "description" : "Start by resting arms at the sides. Hold the band behind the back. Bend the active arm and bring the hand the neck with the palm facing in. Bend the down arm and bring the hand to the lower back with the palm facing out. Slowly decrease the distance of the hands while keeping a grip on the band.",
  "title" : "Tricep Stretch (Left Arm)"
}, {
  "description" : "In all-4-up position on forearms and feet. Form a straight line from head to feet. Hands are at shoulder width. Steadily drop the body while remaining rigid. As you drop, simultaneously bring one knee to the same-side lat. Hold for 1 count at the bottom. As you approach full arm extension on the way back up, return the leg to initial Push-Up position. Repeat with opposite side.",
  "title" : "Anchored Spiderman Push-Up"
}, {
  "description" : "Stand in staggered squat position with knees slightly bent. Load the position by slightly dipping the knee and squeezing the glutes. Straighten the legs and jump into the air. Both legs should leave the ground at the same time. In the air, bring the knees up and switch the front and back foot. Land in staggered stance quarter squat with alternate foot position.",
  "title" : "Scissor Jump"
}, {
  "description" : "Stand with the knees slightly bent and with with hands at chest height. Drop the hips as if you are going to sit in a chair and lower the body until your thighs are parallel to the ground. The band stays at the chest during the squat. Push through the balls of the feet and reverse the motion by extending through the hips. Simultaneously extend the elbows to straighten the arms during the upward movement. As full body extension is reached, jump up and onto the box, landing in squat position. Bend the knees and hop backwards off the box into a soft landing.",
  "title" : "Box Jump"
}, {
  "description" : "In all-4-up position on hands and feet. Form a straight line from head to heel. The band crosses in back and extends over the back. Hands make a diamond. Allow the band to force the body down. Keep the elbows touching the sides the entire movement. Hold for 1 count at bottom of the movement. Return to resting position in controlled manner.",
  "title" : "Diamond Push-Up"
}, {
  "description" : "In all-4-up position on forearms and feet. Form a straight line from head to heel. The band crosses in back and extends over the back. Hands at shoulder width. Allow the band to force the body down. Keep the elbows touching the sides the entire movement.Hold for 1 count at bottom of the movement. Return to resting position in controlled manner.",
  "title" : "Normal Push-Up"
}, {
  "description" : "In all-4-up position on forearms and feet. Form a straight line from head to feet. The band crosses in back and extends over the back. Hands at shoulder width +1. Allow the band to force the body down. Keep the elbows touching the sides the entire movement. Hold for 1 count at bottom of the movement. Return to resting position in controlled manner.",
  "title" : "Wide Push-Up"
}, {
  "description" : "Start in a backwards bridge position with the hands and the feet on the floor. Arch your back up as far as you can making sure your glutes are tight. Ensure the arms and lower legs start perpendicular to the floor. Begin to step backwards one hand after the other. As you walk don't let sure butt slump down. Lift and bring the RIGHT FOOT backward about 18 inches, place the foot on the floor. Lift and bring the LEFT HAND backward about 18 inches, place the hand on the floor. Lift and bring the LEFT FOOT backward about 18 inches, place the foot on the floor. Lift and bring the RIGHT HAND backward about 18 inches, place the hand on the floor.",
  "title" : "Crab Walk"
}, {
  "description" : "In all-4-back bridge position on hands and feet. The band crosses on top of body/hips with the end of band attaching to the opposite side hand. The glutes are squeezed and in-line with shoulders and knees at start. Bend the elbows while keeping the knee angle consistent and drop the body to the floor. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Tricep Dip"
}, {
  "description" : "Sit with the back off of the ground at a 45 degree angle. The legs are bent in with feet off of the ground. Hold the hands together in front of the chest. Rotate the hands as far as you can. The eyes follow the hands the entire movement. Return to starting position in controlled manner.",
  "title" : "Russian Twists"
}, {
  "description" : "Stand tall with the arms in 90 degree position. The hand is positioned behind the head and the elbow is angled out. The band is positioned behind the body. Hinge at elbow and fully extend arms. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Standing Kick-Out (Left Arm)"
}, {
  "description" : "Stand tall with the arms in 90 degree position. The hand is positioned behind the head and the elbow is angled out. The band is positioned behind the body. Hinge at elbow and fully extend arms. Hold for 1 count. Return to resting position in controlled manner.",
  "title" : "Standing Kick-Out (Right Arm)"
}, {
  "description" : "Lie on the back with the Link under the body. The legs are fully bent and the knees are at the chest. Shoulders remain on ground entire time. Simultaneously straighten the legs vertical and lift the lower back off the ground. Hold for 1 count. Return to starting position in controlled manner. Straighten the legs horizontal. Hold for 1 count. Return to starting position in controlled manner.",
  "title" : "Up&Out"
}, {
  "description" : "Squeeze the glutes and core. Position the band so it is applying downward force on the hip region. Push through the down heel and scapula. The feet stay in dorsiflexion. Raise the hips while keeping the glutes activated. Lead with the active leg heel. Hold for 3 count. Return the hips to starting position in a controlled manner.",
  "title" : "Hip Extension - Knee Up (Left Leg)"
}, {
  "description" : "Squeeze the glutes and core. Position the band so it is applying downward force on the hip region. Push through the down heel and scapula. The feet stay in dorsiflexion. Raise the hips while keeping the glutes activated. Lead with the active leg heel. Hold for 3 count. Return the hips to starting position in a controlled manner.",
  "title" : "Hip Extension - Knee Up (Right Leg)"
}, {
  "description" : "Keep the upper back firm against the ground and avoid hyperextension in the back. The active leg must be relaxed to enable full hip elongation. Hold the stretch position for 30 seconds so the Link can take up slack as the muscle relaxes and allows for further mobility. Maintain dorsiflexion throughout the entire movement.",
  "title" : "Hip Rotation (Left)"
}, {
  "description" : "Keep the upper back firm against the ground and avoid hyperextension in the back. The active leg must be relaxed to enable full hip elongation. Hold the stretch position for 30 seconds so the Link can take up slack as the muscle relaxes and allows for further mobility. Maintain dorsiflexion throughout the entire movement.",
  "title" : "Hip Rotation (Right)"
}, {
  "description" : "Keep the legs rigid by squeezing the glutes. Control the movement and keep the circles as circles, Don't let them start to just make random movements.",
  "title" : "Anchored Leg Circle (Clockwise)"
}, {
  "description" : "Keep the legs rigid by squeezing the glutes. Control the movement and keep the circles as circles, Don't let them start to just make random movements.",
  "title" : "Anchored Leg Circle (Counter-Clockwise)"
} ]
